namespace Task_4
{

    public class Program
    {
        static void Main(string[] args)
        {
            var List = new BookList{
            new Book("Воронов, М.В. - Введение в системный анализ",312),
            new Book("Das Kapital. Kritik der politischen Ökonomie",960),
            new Book("Фотоальбом - Москва 1920-x",18),
            new Book("Государство и революция. В.И. Ленин",332),
            new Book("Мастер и Маргарита. М.А. Булгаков",333),
            new Book("Великие подвиги древних Русов. А.С. Багиров",15),
            new Book("Митин, А.И. - Прикладные системы компьютерной графики",88),
            new Book("Происхождение видов путём естественного отбора. Чарлз Дарвин",502),
            new Book("Евангелие от Марка",320),
        };

            List.PrintSortedBooks();
        }
    }

}

// --------------------------------------------------------------------------------------------------
// |                                                                        Название|    Кол-во стр.|
// --------------------------------------------------------------------------------------------------
// |                                     Воронов, М.В. - Введение в системный анализ|            312|
// |                                             Государство и революция. В.И. Ленин|            332|
// |                                                              Евангелие от Марка|            320|
// |                                               Мастер и Маргарита. М.А. Булгаков|            333|
// |                           Митин, А.И. - Прикладные системы компьютерной графики|             88|
// |                    Происхождение видов путём естественного отбора. Чарлз Дарвин|            502|
// |                                    Das Kapital. Kritik der politischen Ökonomie|            960|
// --------------------------------------------------------------------------------------------------